In [1]:
import numpy as np
import pandas as pd

##### 文本文件讀取：

In [2]:
order = pd.read_csv('meal_order_info.csv', encoding="gbk", sep=",")

##### 通用文本文件讀取方法：

In [3]:
order = pd.read_table(r'meal_order_info.csv', encoding="gbk", sep=",")

##### Excel文件讀取 。xls，xlsx兩種後綴都可以：

In [4]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = None) # sheet_name = None 表示返回所有表
detail.keys() # 仿照字典查看所有的表

dict_keys(['meal_order_detail1', 'meal_order_detail2', 'meal_order_detail3'])

##### 獲取每一張表的內容

In [5]:
detail['meal_order_detail1']

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2775,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2776,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2777,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2778,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### header 表示將第 3 行作為列索引， skiprow 表示忽略第  1 ，2 行

In [6]:
detail = pd.read_excel('meal_order_detail.xlsx', sheet_name = 0, header = 2, skiprows = [0, 1])

In [7]:
detail

,2966,417,610038,NA,NA.1,芝麻烤紫菜,0,1,25,NA.2,2016-08-01 11:11:11,NA.3,NA.4,NA.5,0.1,NA.6,NA.7,caipu/105002.jpg,1442
0,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
1,1899,301,610019,NaN,NaN,白斩鸡,0,1,88,NaN,2016-08-01 11:15:57,NaN,NaN,NaN,0,NaN,NaN,caipu/204002.jpg,1095
2,1902,301,609991,NaN,NaN,香烤牛排,0,1,55,NaN,2016-08-01 11:19:12,NaN,NaN,NaN,0,NaN,NaN,caipu/201001.jpg,1095
3,1906,301,609983,NaN,NaN,干锅田鸡,0,1,88,NaN,2016-08-01 11:22:21,NaN,NaN,NaN,0,NaN,NaN,caipu/205003.jpg,1095
4,1907,301,609981,NaN,NaN,桂圆枸杞鸽子汤,0,1,48,NaN,2016-08-01 11:22:53,NaN,NaN,NaN,0,NaN,NaN,caipu/205001.jpg,1095
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2770,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2771,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2772,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2773,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2774,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

##### DataFrame的查詢：

In [8]:
columns = ['Name', 'Age', 'Class', 'PhoneNum', 'IDNum']
data = [['Mary', 20, 1401, '18734444', 1], ['Oz', 21, 1401, '18734445', 2],['Jerry', 20, 1401, '18767442', 3]]
df = pd.DataFrame(columns = columns, data = data)
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   20   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 基本切片：

In [9]:
df['Name'] #返回一個Series類型。

0     Mary
1       Oz
2    Jerry
Name: Name, dtype: object

In [10]:
df[['Name']] # 返回一個DataFrame類型

    Name
0   Mary
1     Oz
2  Jerry

In [11]:
df[['Name', 'Age']] #多列切片

    Name  Age
0   Mary   20
1     Oz   21
2  Jerry   20

In [12]:
df[['Name', 'Age']][:2] #先切列再切行，返回姓名和年齡列的前兩行

   Name  Age
0  Mary   20
1    Oz   21

##### 靈活切片： loc / iloc

In [13]:
df.loc[:1, ['Name', 'Age']] #前面表示0到1行（包含1），後面表示切姓名和年齡列。

   Name  Age
0  Mary   20
1    Oz   21

In [14]:
df.iloc[:2, [0, 1]] # 前面0到1行，不包含2，後面返回第0，1列。

   Name  Age
0  Mary   20
1    Oz   21

In [15]:
df.loc[df['Age'] < 21, ['Name','PhoneNum']] #返回年齡小於21歲的人的姓名

    Name  PhoneNum
0   Mary  18734444
2  Jerry  18767442

##### Mask 切片

In [16]:
mask = df['Age'] < 21 #返回一個Bool的series
mask

0     True
1    False
2     True
Name: Age, dtype: bool

In [17]:
df.loc[mask,['Name', 'Age']]

    Name  Age
0   Mary   20
2  Jerry   20

##### 更改數據：

In [18]:
df.loc[df['Name'] == 'Mary', 'Age'] = 22 # 直接修改了數據
df

    Name  Age  Class  PhoneNum  IDNum
0   Mary   22   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

##### 增添數據：

In [19]:
df['Gender'] = pd.Series(['F', 'M', 'M']) #直接添加了一列
df

    Name  Age  Class  PhoneNum  IDNum Gender
0   Mary   22   1401  18734444      1      F
1     Oz   21   1401  18734445      2      M
2  Jerry   20   1401  18767442      3      M

In [20]:
df.loc[3] = ['Olivia', 19, 1402, '16098232', 4, 'F'] #也可以用loc 直接添加行

In [21]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

##### 刪除行和列

In [22]:
df.drop(labels = 'PhoneNum', axis = 1) # 1表示對列的刪除

     Name  Age  Class  IDNum Gender
0    Mary   22   1401      1      F
1      Oz   21   1401      2      M
2   Jerry   20   1401      3      M
3  Olivia   19   1402      4      F

In [23]:
df.drop(labels = 0, axis = 0) #0 表示對行的刪除

     Name  Age  Class  PhoneNum  IDNum Gender
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

#### 原來的DataFrame 並沒有被修改，如想要修改添加 inplace = Ture 參數來修改原數據表

In [24]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

### <font color = "red"> 統計分析方法： </font>

##### 1. 用Numpy的部分方法：

In [25]:
np.mean(df['Age']) #求年齡的平均值

20.5

##### 2. Pandas 的統計方法： <font color= "hotpink"> Pandas中有一些Numpy沒有的統計方法 </font>

In [26]:
df['Age'].mean() #一樣是求年齡的平均值

20.5

##### 1）統計非 Nan值：

In [27]:
df['Age'].count()  #返回一個數值：

4

In [28]:
df[['Age']].count()  #返回一個Series

Age    4
dtype: int64

##### 2）統計頻數：

In [29]:
df['Gender'].value_counts()  # 返回一個Series類型 該方法是Series中的方法，在DataFrame中沒有該方法。

M    2
F    2
Name: Gender, dtype: int64

##### 3）众數：

In [30]:
df['Gender'].mode()

0    F
1    M
dtype: object

##### 4)  describe(  ) 返回非空數，平均值，標準差，最小值，最大值及四分衛數

In [31]:
df['Age'].describe()  #返回一個Series類型。

count     4.000000
mean     20.500000
std       1.290994
min      19.000000
25%      19.750000
50%      20.500000
75%      21.250000
max      22.000000
Name: Age, dtype: float64

In [32]:
df[['Age','Name']].describe()  #如果數值型的和字符串型在一起，會自動忽略字符串的統計。

             Age
count   4.000000
mean   20.500000
std     1.290994
min    19.000000
25%    19.750000
50%    20.500000
75%    21.250000
max    22.000000

##### 當作用與類別型的時候：

In [33]:
df['Name'].describe()   # 返回非空值數、類別數、众數（只返回一個）、众數出現的頻率數

count          4
unique         4
top       Olivia
freq           1
Name: Name, dtype: object

In [34]:
df

     Name  Age  Class  PhoneNum  IDNum Gender
0    Mary   22   1401  18734444      1      F
1      Oz   21   1401  18734445      2      M
2   Jerry   20   1401  18767442      3      M
3  Olivia   19   1402  16098232      4      F

##### 練習：

In [35]:
detail = pd.read_excel('meal_order_detail.xlsx')
detail

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,NaN,NaN,白饭/大碗,0,1,10,NaN,2016-08-10 21:56:24,NaN,NaN,NaN,0,NaN,NaN,caipu/601005.jpg,1138
2775,6742,774,609996,NaN,NaN,牛尾汤,0,1,40,NaN,2016-08-10 21:56:48,NaN,NaN,NaN,0,NaN,NaN,caipu/201006.jpg,1138
2776,6756,774,609949,NaN,NaN,意文柠檬汁,0,1,13,NaN,2016-08-10 22:01:52,NaN,NaN,NaN,0,NaN,NaN,caipu/404005.jpg,1138
2777,6763,774,610014,NaN,NaN,金玉良缘,0,1,30,NaN,2016-08-10 22:03:58,NaN,NaN,NaN,0,NaN,NaN,caipu/302003.jpg,1138
2778,6764,774,610017,NaN,NaN,酸辣藕丁,0,1,33,NaN,2016-08-10 22:04:30,NaN,NaN,NaN,0,NaN,NaN,caipu/302006.jpg,1138

In [36]:
detail['dishes_name'].describe()

count      2779
unique      157
top       白饭/大碗
freq         92
Name: dishes_name, dtype: object

In [37]:
df['is_Check'] = [0, 1, 1, 0]

In [38]:
df

     Name  Age  Class  PhoneNum  IDNum Gender  is_Check
0    Mary   22   1401  18734444      1      F         0
1      Oz   21   1401  18734445      2      M         1
2   Jerry   20   1401  18767442      3      M         1
3  Olivia   19   1402  16098232      4      F         0

In [39]:
df['is_Check'].describe()  #會返回數值型的錯誤

count    4.00000
mean     0.50000
std      0.57735
min      0.00000
25%      0.00000
50%      0.50000
75%      1.00000
max      1.00000
Name: is_Check, dtype: float64

##### <font color = "red"> 需要強轉成類別型來describe </font>

In [40]:
df['is_Check'].astype('category').describe()

count     4
unique    2
top       1
freq      2
Name: is_Check, dtype: int64

##### 練習：1. 對表格清洗，刪除表中左右為Nan值的列，或者刪除取值相同的列 <br> 2.刪除列表中列的值全部相同的

In [41]:
mask = detail.count() == 0   #非空值為0，則整列都是Nan,返回一個Bool的數列
label_nan = mask.index[mask] 
detail.drop(labels = label_nan, axis = 1, inplace = True)
detail

,detail_id,order_id,dishes_id,dishes_name,itemis_add,counts,amounts,place_order_time,add_inprice,picture_file,emp_id
0,2956,417,610062,蒜蓉生蚝,0,1,49,2016-08-01 11:05:36,0,caipu/104001.jpg,1442
1,2958,417,609957,蒙古烤羊腿,0,1,48,2016-08-01 11:07:07,0,caipu/202003.jpg,1442
2,2961,417,609950,大蒜苋菜,0,1,30,2016-08-01 11:07:40,0,caipu/303001.jpg,1442
3,2966,417,610038,芝麻烤紫菜,0,1,25,2016-08-01 11:11:11,0,caipu/105002.jpg,1442
4,2968,417,610003,蒜香包,0,1,13,2016-08-01 11:11:30,0,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,白饭/大碗,0,1,10,2016-08-10 21:56:24,0,caipu/601005.jpg,1138
2775,6742,774,609996,牛尾汤,0,1,40,2016-08-10 21:56:48,0,caipu/201006.jpg,1138
2776,6756,774,609949,意文柠檬汁,0,1,13,2016-08-10 22:01:52,0,caipu/404005.jpg,1138
2777,6763,774,610014,金玉良缘,0,1,30,2016-08-10 22:03:58,0,caipu/302003.jpg,1138
2778,6764,774,610017,酸辣藕丁,0,1,33,2016-08-10 22:04:30,0,caipu/302006.jpg,1138

In [42]:
freq = detail.astype('category').describe().loc['freq',]
mask_freq = freq == detail.shape[0]
label_sim = mask_freq.index[mask_freq]
detail.drop(labels = label_sim, axis = 1, inplace = True)
detail

,detail_id,order_id,dishes_id,dishes_name,counts,amounts,place_order_time,picture_file,emp_id
0,2956,417,610062,蒜蓉生蚝,1,49,2016-08-01 11:05:36,caipu/104001.jpg,1442
1,2958,417,609957,蒙古烤羊腿,1,48,2016-08-01 11:07:07,caipu/202003.jpg,1442
2,2961,417,609950,大蒜苋菜,1,30,2016-08-01 11:07:40,caipu/303001.jpg,1442
3,2966,417,610038,芝麻烤紫菜,1,25,2016-08-01 11:11:11,caipu/105002.jpg,1442
4,2968,417,610003,蒜香包,1,13,2016-08-01 11:11:30,caipu/503002.jpg,1442
...,...,...,...,...,...,...,...,...,...
2774,6750,774,610011,白饭/大碗,1,10,2016-08-10 21:56:24,caipu/601005.jpg,1138
2775,6742,774,609996,牛尾汤,1,40,2016-08-10 21:56:48,caipu/201006.jpg,1138
2776,6756,774,609949,意文柠檬汁,1,13,2016-08-10 22:01:52,caipu/404005.jpg,1138
2777,6763,774,610014,金玉良缘,1,30,2016-08-10 22:03:58,caipu/302003.jpg,1138
2778,6764,774,610017,酸辣藕丁,1,33,2016-08-10 22:04:30,caipu/302006.jpg,1138

##### 轉換與處理時間序列：

In [43]:
detail['place_order_time'] = pd.to_datetime(detail.place_order_time) #返回Datatime類型
detail['place_order_time'].dtype

dtype('<M8[ns]')

In [44]:
detail.place_order_time[0]

Timestamp('2016-08-01 11:05:36')

In [45]:
detail.place_order_time[0].year

2016

In [46]:
detail.place_order_time[0].month

8

In [47]:
detail.place_order_time[0].day

1

In [48]:
detail.place_order_time[0].hour

11

In [49]:
detail.place_order_time[0].minute

5

In [50]:
detail.place_order_time[0].second

36

In [51]:
detail.place_order_time[0].dayofyear #顯示一年中的第幾天

214

In [52]:
detail.place_order_time[0].quarter # 顯示季節

3

In [53]:
detail.place_order_time[0].dayofweek #顯示一週中的第幾天

0

In [54]:
detail.place_order_time[0].day_name() #顯示星期

'Monday'

In [55]:
detail.place_order_time[0].date()

datetime.date(2016, 8, 1)

##### 提取整列的年份： <font color = "red"> dt </font>

In [56]:
simpletime = detail.place_order_time
simpletime.dt.year

0       2016
1       2016
2       2016
3       2016
4       2016
        ...
2774    2016
2775    2016
2776    2016
2777    2016
2778    2016
Name: place_order_time, Length: 2779, dtype: int64

In [57]:
simpletime.dt.day_name()

0          Monday
1          Monday
2          Monday
3          Monday
4          Monday
          ...
2774    Wednesday
2775    Wednesday
2776    Wednesday
2777    Wednesday
2778    Wednesday
Name: place_order_time, Length: 2779, dtype: object

In [58]:
simpletime.dt.date

0       2016-08-01
1       2016-08-01
2       2016-08-01
3       2016-08-01
4       2016-08-01
           ...
2774    2016-08-10
2775    2016-08-10
2776    2016-08-10
2777    2016-08-10
2778    2016-08-10
Name: place_order_time, Length: 2779, dtype: object

------------------------

In [59]:
[i * 2 for i in range(10)] # 推倒式

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

---------------------------

##### 時間的運算：

In [60]:
simpletime + pd.Timedelta(days = 1) #將日期整體向後平移一天

0      2016-08-02 11:05:36
1      2016-08-02 11:07:07
2      2016-08-02 11:07:40
3      2016-08-02 11:11:11
4      2016-08-02 11:11:30
               ...
2774   2016-08-11 21:56:24
2775   2016-08-11 21:56:48
2776   2016-08-11 22:01:52
2777   2016-08-11 22:03:58
2778   2016-08-11 22:04:30
Name: place_order_time, Length: 2779, dtype: datetime64[ns]

##### 求用餐時間的均值：

In [61]:
order = pd.read_csv('meal_order_info.csv', encoding = 'gbk', sep = ',')

In [62]:
order.use_start_time = pd.to_datetime(order.use_start_time) #把時間轉換成標準時間格式
order.lock_time = pd.to_datetime(order.lock_time)
during = order.lock_time - order.use_start_time

##### 設定條件：

In [63]:
mask = (during < pd.to_timedelta(0)) | (during.dt.days > 1) #設定條件：時間為負值，或者大於1天的。
mask.index[mask]

Int64Index([ 82, 106, 115, 118, 128, 170, 188, 197, 215, 220, 303, 321, 429,
            433, 439, 513, 518, 526, 527, 551, 560, 567, 625, 785, 806, 828,
            843, 896, 944],
           dtype='int64')

In [64]:
during.drop(labels = mask.index[mask], axis = 0, inplace = True) #根據條件刪除無效的數據

In [65]:
during.shape

(916,)

In [66]:
during.mean()  #算出平均的點餐時間

Timedelta('0 days 00:11:20.639470')

##### 求菜品賣得最好的前5個

In [67]:
mask = detail.dishes_name.str.contains('白饭') #刪除白飯類型的菜品
detail.drop(mask.index[mask], axis = 0, inplace = True)
detail.dishes_name.value_counts().head()

凉拌菠菜         77
谷稻小庄         72
麻辣小龙虾        65
五色糯米饭(七色)    58
芝士烩波士顿龙虾     55
Name: dishes_name, dtype: int64

#### *分組聚合*：

In [68]:
df.loc[5] = ['Judy',20,1402,'18696633',6,'F',1]
df.loc[4] = ['Bob',22,1402,'18690233',5,'M',1]
df['Credits'] = [92, 84, 72, 82, 69, 77]

In [69]:
credits = df.loc[:,['Class','Credits','Age']]
credits.groupby(by = 'Class').mean() #根据分组求出平均值，返回一个DataFrame类型

         Credits        Age
Class
1401   82.666667  21.000000
1402   76.000000  20.333333

In [70]:
credits.groupby(by = 'Class').mean().index # 注意，班级的值变成了索引，Credits才是值

Int64Index([1401, 1402], dtype='int64', name='Class')

##### 可以用reset_index()方法來重新索引

In [71]:
credits.groupby(by = 'Class').mean().reset_index()

   Class    Credits        Age
0   1401  82.666667  21.000000
1   1402  76.000000  20.333333

In [72]:
credits.groupby(by = 'Class').mean().reset_index().index  #索引又重新變成正常

RangeIndex(start=0, stop=2, step=1)

##### agg（）方法 對不同的列用相同的統計方法

In [73]:
credits.agg([np.sum, np.mean])

       Class     Credits         Age
sum   8409.0  476.000000  124.000000
mean  1401.5   79.333333   20.666667

##### agg（）方法 對不同的列用<font color = "hotpink">不同</font>的統計方法

In [74]:
credits.agg({'Credits': np.mean, 'Age': [np.mean, np.std]}) #可傳多個參數。

        Credits        Age
mean  79.333333  20.666667
std         NaN   1.211060

In [75]:
credits.agg({'Credits': np.mean, 'Age': np.std})

Credits    79.333333
Age         1.211060
dtype: float64

##### transform() 就是傳一個方法，方法可以自己寫

In [76]:
credits[['Credits', 'Age']].transform(lambda x: x*2) #對成績和年齡兩行進行操作。

   Credits  Age
0      184   44
1      168   42
2      144   40
3      164   38
5      138   40
4      154   44

##### 統計飯店每天有幾個訂單

In [77]:
detail.order_id = detail.order_id.astype('category')
detail[['order_id','place_order_time']].groupby(by = detail.place_order_time.dt.date).describe()

                 order_id                                 place_order_time  \
                    count unique     top  freq first last            count
place_order_time
2016-08-01          204.0   22.0   392.0  24.0   NaN  NaN              204
2016-08-02          130.0   18.0   650.0  15.0   NaN  NaN              130
2016-08-03          149.0   16.0   776.0  16.0   NaN  NaN              149
2016-08-04          136.0   13.0   557.0  19.0   NaN  NaN              136
2016-08-05          184.0   21.0  1070.0  16.0   NaN  NaN              184
2016-08-06          664.0   71.0  1026.0  21.0   NaN  NaN              664
2016-08-07          659.0   64.0  1139.0  22.0   NaN  NaN              659
2016-08-08          152.0   16.0   663.0  20.0   NaN  NaN              152
2016-08-09          137.0   16.0   165.0  17.0   NaN  NaN              137
2016-08-10          212.0   21.0   314.0  21.0   NaN  NaN              212

                                                                        \
                 unique                  top freq                first
place_order_time
2016-08-01          204  2016-08-01 17:43:29    1  2016-08-01 11:05:36
2016-08-02          129  2016-08-02 18:23:45    2  2016-08-02 11:20:59
2016-08-03          148  2016-08-03 19:55:26    2  2016-08-03 12:52:11
2016-08-04          135  2016-08-04 17:38:22    2  2016-08-04 11:06:43
2016-08-05          183  2016-08-05 21:04:50    2  2016-08-05 12:04:54
2016-08-06          644  2016-08-06 18:05:57    3  2016-08-06 11:05:05
2016-08-07          647  2016-08-07 11:18:09    2  2016-08-07 11:03:24
2016-08-08          151  2016-08-08 18:20:48    2  2016-08-08 11:04:28
2016-08-09          135  2016-08-09 20:05:14    2  2016-08-09 11:07:48
2016-08-10          210  2016-08-10 12:00:47    2  2016-08-10 11:12:16


                                 last
place_order_time
2016-08-01        2016-08-01 21:52:14
2016-08-02        2016-08-02 21:54:18
2016-08-03        2016-08-03 21:39:37
2016-08-04        2016-08-04 22:07:52
2016-08-05        2016-08-05 22:07:59
2016-08-06        2016-08-06 22:12:15
2016-08-07        2016-08-07 22:06:26
2016-08-08        2016-08-08 22:04:23
2016-08-09        2016-08-09 21:46:24
2016-08-10        2016-08-10 22:04:30

##### 數據透視表：

In [78]:
df

     Name  Age  Class  PhoneNum  IDNum Gender  is_Check  Credits
0    Mary   22   1401  18734444      1      F         0       92
1      Oz   21   1401  18734445      2      M         1       84
2   Jerry   20   1401  18767442      3      M         1       72
3  Olivia   19   1402  16098232      4      F         0       82
5    Judy   20   1402  18696633      6      F         1       69
4     Bob   22   1402  18690233      5      M         1       77

In [79]:
pd.pivot_table(df, columns = 'Class', aggfunc = 'mean') #設置列分組

Class          1401       1402
Age       21.000000  20.333333
Credits   82.666667  76.000000
IDNum      2.000000   5.000000
is_Check   0.666667   0.666667

In [80]:
 pd.pivot_table(df, index = 'Class', aggfunc = 'mean') #設置行分組

             Age    Credits  IDNum  is_Check
Class
1401   21.000000  82.666667      2  0.666667
1402   20.333333  76.000000      5  0.666667

##### 雙重索引

In [81]:
pd.pivot_table(df, index = ['Class','Gender'], aggfunc = 'mean')

               Age  Credits  IDNum  is_Check
Class Gender
1401  F       22.0     92.0    1.0       0.0
      M       20.5     78.0    2.5       1.0
1402  F       19.5     75.5    5.0       0.5
      M       22.0     77.0    5.0       1.0

In [82]:
pd.pivot_table(df,index = 'Gender', columns = 'Class') #最常用的方法。

         Age       Credits       IDNum      is_Check
Class   1401  1402    1401  1402  1401 1402     1401 1402
Gender
F       22.0  19.5    92.0  75.5   1.0  5.0      0.0  0.5
M       20.5  22.0    78.0  77.0   2.5  5.0      1.0  1.0

##### 指定顯示的列：

In [83]:
pd.pivot_table(df, index = 'Class', values = 'Credits') #values 用來指定顯示的列。

         Credits
Class
1401   82.666667
1402   76.000000

##### 當數據缺失的時候，自動填充 fill_value 參數。

In [84]:
df

     Name  Age  Class  PhoneNum  IDNum Gender  is_Check  Credits
0    Mary   22   1401  18734444      1      F         0       92
1      Oz   21   1401  18734445      2      M         1       84
2   Jerry   20   1401  18767442      3      M         1       72
3  Olivia   19   1402  16098232      4      F         0       82
5    Judy   20   1402  18696633      6      F         1       69
4     Bob   22   1402  18690233      5      M         1       77

In [85]:
df.loc[6] = ['Flee', 20, 1403, '17423456', 7, 'M', 1, 88]
df.loc[7] = ['Joy', 21, 1403, '17421090', 8, 'M', 1, 76]
df.loc[8] = ['Joy', 21, 1403, '17421090', 8, 'F', np.nan, 90]

In [86]:
pd.pivot_table(df, index = ["Class","Gender"], values = ["Credits","is_Check"], fill_value = "無")

              Credits is_Check
Class Gender
1401  F          92.0        0
      M          78.0        1
1402  F          75.5      0.5
      M          77.0        1
1403  F          90.0        無
      M          82.0        1

##### 匯總： margins = True

In [87]:
df.loc[8,'IDNum'] = 9
df

     Name  Age  Class  PhoneNum  IDNum Gender  is_Check  Credits
0    Mary   22   1401  18734444      1      F       0.0       92
1      Oz   21   1401  18734445      2      M       1.0       84
2   Jerry   20   1401  18767442      3      M       1.0       72
3  Olivia   19   1402  16098232      4      F       0.0       82
5    Judy   20   1402  18696633      6      F       1.0       69
4     Bob   22   1402  18690233      5      M       1.0       77
6    Flee   20   1403  17423456      7      M       1.0       88
7     Joy   21   1403  17421090      8      M       1.0       76
8     Joy   21   1403  17421090      9      F       NaN       90

In [88]:
pd.pivot_table(df, margins = True, index = 'Class') #這時候會發現IDNum的統計值出現了問題

             Age    Credits  IDNum  is_Check
Class
1401   21.000000  82.666667    2.0  0.666667
1402   20.333333  76.000000    5.0  0.666667
1403   20.666667  84.666667    8.0  1.000000
All    20.625000  80.000000    4.5  0.750000

In [89]:
pd.pivot_table(df, margins = True, index = 'Class', dropna = False) #

             Age    Credits  IDNum  is_Check
Class
1401   21.000000  82.666667    2.0  0.666667
1402   20.333333  76.000000    5.0  0.666667
1403   20.666667  84.666667    8.0  1.000000
All    20.666667  81.111111    5.0  0.750000

##### 交叉表：crosstab

In [90]:
pd.crosstab(index = df.Class, values = df.Credits, columns = df.Gender, aggfunc = np.max)

Gender   F   M
Class
1401    92  84
1402    82  77
1403    90  88

##### 表的合併：

In [94]:
df_p1 = pd.DataFrame(columns = ['Name', 'Age', 'Class'], data = [['Mary', 20, 1401], ['Oz', 21, 1401],['Jerry', 20, 1401]])

In [95]:
df_p2 = pd.DataFrame(columns = ['PhoneNum', 'IDNum'], data = [['18734444', 1], ['18734445', 2],['18767442', 3]])

In [100]:
 pd.concat([df_p1, df_p2], axis = 1)  #橫向合併表格

    Name  Age  Class  PhoneNum  IDNum
0   Mary   20   1401  18734444      1
1     Oz   21   1401  18734445      2
2  Jerry   20   1401  18767442      3

In [101]:
pd.concat([df_p1, df_p2], axis = 0)  #縱向合併表格

    Name   Age   Class  PhoneNum  IDNum
0   Mary  20.0  1401.0       NaN    NaN
1     Oz  21.0  1401.0       NaN    NaN
2  Jerry  20.0  1401.0       NaN    NaN
0    NaN   NaN     NaN  18734444    1.0
1    NaN   NaN     NaN  18734445    2.0
2    NaN   NaN     NaN  18767442    3.0

In [103]:
p2_index = pd.Series(['a', 'b', 'c']) 
df_p2 = df_p2.set_index(p2_index)
df_p2

   PhoneNum  IDNum
a  18734444      1
b  18734445      2
c  18767442      3

##### <font color = "dd0000"> 橫向合併是根據索引值來合併的，索引值不同，就會錯位 </font>

In [105]:
pd.concat([df_p1, df_p2], axis = "columns") #橫向合併 axis = 1

    Name   Age   Class  PhoneNum  IDNum
0   Mary  20.0  1401.0       NaN    NaN
1     Oz  21.0  1401.0       NaN    NaN
2  Jerry  20.0  1401.0       NaN    NaN
a    NaN   NaN     NaN  18734444    1.0
b    NaN   NaN     NaN  18734445    2.0
c    NaN   NaN     NaN  18767442    3.0

##### <font color = "red"> 內鏈接找同樣的索引值，如果沒有，就返回沒有數據，外連結如果沒有，就在下面連接上 </font>

In [107]:
pd.concat([df_p1, df_p2], axis = "columns", join = 'inner') #join = 'inner' 表示內連接

Empty DataFrame
Columns: [Name, Age, Class, PhoneNum, IDNum]
Index: []

In [108]:
p2_index = pd.Series([0, 'b', 'c']) 
df_p2 = df_p2.set_index(p2_index)
df_p2

   PhoneNum  IDNum
0  18734444      1
b  18734445      2
c  18767442      3

In [109]:
pd.concat([df_p1, df_p2], axis = "columns", join = 'inner') #join = 'inner' 表示內連接

   Name  Age  Class  PhoneNum  IDNum
0  Mary   20   1401  18734444      1

In [110]:
pd.concat([df_p1, df_p2], axis = "columns", join = 'outer') #join = 'outer' 表示外連接

    Name   Age   Class  PhoneNum  IDNum
0   Mary  20.0  1401.0  18734444    1.0
1     Oz  21.0  1401.0       NaN    NaN
2  Jerry  20.0  1401.0       NaN    NaN
b    NaN   NaN     NaN  18734445    2.0
c    NaN   NaN     NaN  18767442    3.0

##### 縱向連接值看列的名字

In [111]:
df_p3 = pd.DataFrame(columns = ['Name', 'Age', 'Class'], data = [['judy', 21, 1403], ['Mosh', 21, 1403],['Henry', 20, 1403]])

In [115]:
df_p1, df_p3

(    Name  Age  Class
 0   Mary   20   1401
 1     Oz   21   1401
 2  Jerry   20   1401,
     Name  Age  Class
 0   judy   21   1403
 1   Mosh   21   1403
 2  Henry   20   1403)

In [116]:
pd.concat([df_p1, df_p3], axis = "index") #axis 參數可以是index 也可以是0 橫向相加

    Name  Age  Class
0   Mary   20   1401
1     Oz   21   1401
2  Jerry   20   1401
0   judy   21   1403
1   Mosh   21   1403
2  Henry   20   1403

In [117]:
df_p4 = pd.DataFrame(columns = ['Name', 'Age', 'Class', 'Credits'], data = [['judy', 21, 1403, 88], ['Mosh', 21, 1403, 90],['Henry', 20, 1403, 76]])

In [119]:
df_p4 #加了一欄成績

    Name  Age  Class  Credits
0   judy   21   1403       88
1   Mosh   21   1403       90
2  Henry   20   1403       76

##### 橫向的內部堆疊只考慮<font color = "hotpink"> 列索引 </font> 相同的，外部堆疊就全部堆疊上去

In [118]:
pd.concat([df_p1, df_p4], axis = 'index', join = "inner") #橫向內部堆疊

    Name  Age  Class
0   Mary   20   1401
1     Oz   21   1401
2  Jerry   20   1401
0   judy   21   1403
1   Mosh   21   1403
2  Henry   20   1403

In [120]:
pd.concat([df_p1, df_p4], axis = 'index', join = "outer")

    Name  Age  Class  Credits
0   Mary   20   1401      NaN
1     Oz   21   1401      NaN
2  Jerry   20   1401      NaN
0   judy   21   1403     88.0
1   Mosh   21   1403     90.0
2  Henry   20   1403     76.0

### 主鍵合併 merge()_

In [130]:
left = pd.DataFrame({'key1':['k0', 'k0', 'k1', 'k2'],
                   'key2':['k0', 'k1', 'k0', 'k1'],
                   'A':['a0', 'a1', 'a2', 'a3'],
                  'B':['b0', 'b1', 'b2', 'b3'],})

In [131]:
right = pd.DataFrame({'key1':['k0', 'k1', 'k1', 'k3'],
                   'key2':['k0', 'k0', 'k0', 'k0'],
                   'C':['c0', 'c1', 'c2', 'c3'],
                  'D':['d0', 'd1', 'd2', 'd3'],})

In [132]:
left

  key1 key2   A   B
0   k0   k0  a0  b0
1   k0   k1  a1  b1
2   k1   k0  a2  b2
3   k2   k1  a3  b3

In [133]:
right

  key1 key2   C   D
0   k0   k0  c0  d0
1   k1   k0  c1  d1
2   k1   k0  c2  d2
3   k3   k0  c3  d3

In [134]:
pd.merge(left, right, on = "key1") #根據列索引裡面的Key1 合併，Ho默認是“inner”，k2和k3沒有對應的，所以不予以合併

  key1 key2_x   A   B key2_y   C   D
0   k0     k0  a0  b0     k0  c0  d0
1   k0     k1  a1  b1     k0  c0  d0
2   k1     k0  a2  b2     k0  c1  d1
3   k1     k0  a2  b2     k0  c2  d2

In [138]:
pd.merge(left, right, on = "key1", how = "outer") #如果用外部合併，就會把主鍵不一樣的也合併近來

  key1 key2_x    A    B key2_y    C    D
0   k0     k0   a0   b0     k0   c0   d0
1   k0     k1   a1   b1     k0   c0   d0
2   k1     k0   a2   b2     k0   c1   d1
3   k1     k0   a2   b2     k0   c2   d2
4   k2     k1   a3   b3    NaN  NaN  NaN
5   k3    NaN  NaN  NaN     k0   c3   d3